"""
1.Користувач вводить число_1 та число_2 (діапазон включно).
Виведіть всі числа в цьому діапазоні,
що кратні трьом та при цьому не кратні п’яти.
*Спробуйте реалізувати завдання обома конструкціями циклів (while, for).
"""
#Використовуючи for:
n1 = int(input("Введіть число_1: "))
n2 = int(input("Введіть число_2: "))
for n in range(n1, n2 + 1):
    if n % 3 == 0 and n % 5 != 0:
        print(n)

#Використовуючи while:
n1 = int(input("Введіть число_1: "))
n2 = int(input("Введіть число_2: "))
while n1 <= n2:
    if n1 % 3 == 0 and n1 % 5 != 0:
        print(n1)
    n1 += 1

"""
2.Користувач вводить число. Виведіть результатом факторіал цього числа. 
Заборонено користуватись сторонніми модулями (наприклад, math). 
Пам’ятка: факторіал числа – це множення всіх чисел в діапазоні [1, число]. 
Приклад: 5! = 5*4*3*2*1.
"""
#Використовуючи цикл for:
n = int(input("Введіть число: "))
factorial = 1
for l in range(1, n + 1):
    factorial *= l
print(f"Факторіал {l}! = {factorial}")

#Використовуючи цикл while:
n = int(input("Введіть число: "))
factorial = 1
l = 1
while l <= n:
    factorial *= l
    l += 1
print(f"Факторіал {n}! = {factorial}")

"""
3.Користувач вводить своє ім’я. Дублюйте його ім’я та виводьте у консоль, 
поки його довжина не стане більшою за 100. Приклад: Ім’я: «Анна». 
Перший крок: «АннаАнна» (довжина строки - 8). 
Другий крок: «АннаАннаАнна» (довжина строки - 12) і тд. 
"""
#Використовуючи цикл for:
name = input("Введіть своє ім’я: ")
result = name
for _ in range(100):
    if len(result) > 100:
        break
    print(result)
    result += name

#Використовуючи цикл while:
name = input("Введіть своє ім’я: ")
result = name
while len(result) <= 100:
    print(result)
    result += name

"""
4.Попросіть користувача ввести набір чисел, розділених пробілами. 
Потім підрахуйте кількість парних чи непарних чисел у цьому наборі. 
(Спробуйте не використовувати split)
"""
#Використовуючи цикл for:
numbers = input("Введіть набір чисел, розділених пробілами: ") + " "
even_count = 0
odd_count = 0
num = ""
for char in numbers:
    if char != " ":
        num += char
    elif num:
        if int(num) % 2 == 0:
            even_count += 1
        else:
            odd_count += 1
        num = ""
print(f"Парних чисел: {even_count}")
print(f"Непарних чисел: {odd_count}")

#Використовуючи цикл while:
numbers = input("Введіть набір чисел, розділених пробілами: ") + " "
even_count = 0
odd_count = 0
num = ""
i = 0
while i < len(numbers):
    if numbers[i] != " ":
        num += numbers[i]
    elif num:
        if int(num) % 2 == 0:
            even_count += 1
        else:
            odd_count += 1
        num = ""
    i += 1
print(f"Парних чисел: {even_count}")
print(f"Непарних чисел: {odd_count}")
