# Змінні

print('Hello, world')

user_name = 'Bob'  # = це присвоєння або створення змінної user_name з значенням 'Bob'
print('Hello, ' + user_name + '!') #контамінація , склеювання слів

user_name = 'Bob'
result = 'Hello, ' + user_name + '!'
print(result)  # print -  ВИВІД інформації в консоль

user_name = input("Enter your name: ") # input - це ВВІД інформації в консоль
result = 'Hello, ' + user_name + '!'
print(result)

 # -------БАЗОВІ ОПЕРАЦІЇ-----

            # над числами
number_1 = 10
number_2 = 5
print(10+30)
print(number_1+number_2)
print(number_1-number_2)
print(7-number_2)

print(10 * 5)  # * -  множення
print(10 / 5)  # / -  ділення
print(5 ** 3)  # ** - степінь
print(10 / 5)  # / -  ділення
print(11 // 3)   # / - цілочислене ділення - повертає тілу частку від ділення
number_1 = 10
number_2 = 5
print(number_1 % number_2) # повертає залишок (остача) від ділення
# #  якщо число ділиться повністю, то виводить 0
print(10 % 3) # буде 1 (10-9=1)
print(11 % 3) # буде 2 (11-9=2)

  # над строками (текстом)
text_1 = 'Hi'
text_2 = '10'
print(text_2 + '20')
# буде 1020, відбудеться склеювання, бо + для строк склеювання (contcatenate)

print('S' * 25) # * для строк - дублювання строк n разів /тобто буде SSSSSSSSSSSSSSSSSSSSSSSSS

  # робота зі змінними
counter = 10

print(counter + 1)
counter + 1
counter + 1
print(counter)

counter = 10
counter = 5
print(counter)  виведе 5

counter = counter + 1
counter = counter + 1
counter = counter + 1
#
counter += 1 # += -  додати до змінної 1, та записати в неї результат
#
# # !!!  в програмуванні "=" - присвоєння
print(counter)

print('Python')
a = 10
b = 20
c = 30
print(a, b, c, end='  |новий print|') # end - склеює цей рядок з наступним, тобто виведе рядок виводить -- 10 20 30  |новий print|a,b,c
print('a', 'b', 'c', sep=',') #/ виставить між аргументами коми
print('a', 'b', 'c', sep='') # sep - строка, яка ставиться МІЖ аргументами print
print('1\n2\n3\n4\n5')  # \n - перекидає на наступний абзац між аргументами
print(a, b, c, end='\n') # це по замовчуванню стоїть, але система не показує, система перекидає на новий рядок

'''
 Все, що я напишу тут -
 це багатострочний коментар
'''

number_1 = 1
print(number1)    # NameError - звертаємось до змінної , якої не існує
print(number_1)  # IndentionError - зайвий абсзац або пробіл на початку рядка

print(number_1 + '!')  # TypeError - операція між різними типами даних (конфлікт типів даних)

var = 'Hi' = 5 # SyntaxError  - груба синтаксична помилка
text = 'Hello  # SyntaxError  - груба синтаксична помилка

# #Домашнє завдання №1
print()
print()
#
# #Домашнє завдання №2
print()
print()

a = input('a: ')
b = input('b: ')
#
# # --Ваш код тут
#
#
# # --Ваш код тут
print(a)
print(b)

'''
Завдання 1 
Користувач виводить в консоль своє ім'я, вік, номер телефона
Результат виведіть:
"Привіт, <Антон>. Тобі <25> років. Твій номер телефону:  <+№800001>
'''
name = input('Введіть своє імя: ')
age = input('Введіть свій вік: ')
number = input('Введіть свій мобільний телефон: ')
print('Привіт, ' + name + '. Тобі ' + age + '. Твій номер телефону: ' + number)
'''
Завдання 2: Створіть три змінних з числами.
Результатом, в одному рядку, виведіть:
Суму чисел та їх добуток (*)
'''

'''Завдання 1: Користувач вводить в консоль своє ім'я, вік та номер телефону.
Результатом виведіть:
"Привіть, <Антон>. Тобі <25> років. Твій номер телефону: <+№80000001>"

Завдання 2: Створіть три змінних з числами.
Результатом, в одному рядку, виведіть:
Суму чисел та їх добуток(*)
Приклад:
a=10, b=20, c=30
Результат: 60, 6000
'''

'''
# Завдання 1
name = input('Ім`я: ')
age = input('Вік: ')
phone = input('Номер телефону: ')

print('Привіт, ' + name + '. Твій вік: ' + age + '. Твій номер телефону: ' + phone)
print('Привіт,', name, '.Твій вік:', age, '. Твій номер телефону:', phone)
print(f'Привіт, {name}. Твій вік: {age}. Твій номер телефону: {phone}')

# Завдання 2
a = 25
b = 30
c = 2

print(a + b + c, a * b * c) 
'''